rocksdb/experiments/M2/results/20260429-020219/budget_off/run_2/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 02:14:08 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777428848159621 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.033 micros/op 124488 ops/sec 40.164 seconds 5000000 operations;  123.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      12.205 micros/op 81933 ops/sec 61.025 seconds 5000000 operations;   81.3 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      12.096 micros/op 82670 ops/sec 60.481 seconds 5000000 operations;   82.0 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      1/0   62.29 MB   0.2      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    498.1     30.01             22.38       240    0.125       0      0       0.0       0.0
  L1     34/1    2.05 GB   7.8     27.8    14.5     13.2      24.2     11.0       0.0   1.7    289.0    252.3     98.35             81.35        19    5.176     28M  3589K       0.0       0.0
  L2     93/4    4.45 GB   1.7     18.5     8.4     10.1      14.0      3.9       0.6   1.7    317.3    240.1     59.80             49.04       123    0.486     18M  4585K       0.0       0.0
 Sum    128/5    6.56 GB   0.0     46.3    22.9     23.4      52.8     29.5       0.6   3.6    251.9    287.6    188.16            152.77       382    0.493     47M  8175K       0.0       0.0
 Int      0/0    0.00 KB   0.0     46.0    22.7     23.4      52.2     28.9       0.6   3.7    252.6    286.6    186.64            151.55       375    0.498     46M  8171K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     46.3    22.9     23.4      38.3     14.9       0.0   0.0    299.7    247.7    158.14            130.39       142    1.114     47M  8175K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    498.1     30.01             22.38       240    0.125       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 161.7 total, 158.7 interval
Flush(GB): cumulative 14.598, interval 14.233
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 52.85 GB write, 334.72 MB/s write, 46.29 GB read, 293.15 MB/s read, 188.2 seconds
Interval compaction: 52.25 GB write, 337.17 MB/s write, 46.04 GB read, 297.14 MB/s read, 186.6 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 24, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 26, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 26, total-stops: 0
interval: 26 total count
Block cache LRUCache@0x55aa461d8df0#75793 capacity: 32.00 MB seed: 1729866629 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000181 secs_since: 161
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 161.7 total, 158.7 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 93.43 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 93.43 MB/s
Cumulative stall: 00:01:4.222 H:M:S, 39.7 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14637.47 MB, 92.25 MB/s
Interval WAL: 14M writes, 0 syncs, 14534565.00 writes per sync, written: 14.29 GB, 92.25 MB/s
Interval stall: 00:01:4.222 H:M:S, 40.5 percent
Write Stall (count): write-buffer-manager-limit-stops: 0